// =========================================================================================
// =========================================================================================
// =========  Написати функцію, яка приймає 1 параметр. з тим, що передали перший раз і т. д.
// =========  Все це із замиканнями, наприклад: sum(3) = 3 sum(5) = 8 sum(20) = 28
// =========================================================================================
function count() {
    let sum = 0;
    return function (number) {
        sum += number;
        return sum;
    };
}
const sum = count();

console.log(sum(3));
console.log(sum(5));
<<<<<<< HEAD
console.log(sum(20));
=======
console.log(sum(20));
>>>>>>> 7366501f091a2c27f8508e59dd189b28f1d2acd1
